# Задача «Длина слова».
a = 'Длина слова'
print(len(a))
# Задача «Суммы и разности».
first = 35
second = 25
summa = first + second
diff = first - second
print(summa, diff)
#Задача «Среднее арифметическогое».
third = 45
mean = (summa + third) / 3
print(mean)
#Задача «Простые строчки».
first_string = 'Вторник'
second_string = 'Понедельник'
print(second_string + ', ' + first_string)
# Задача «Сложная формула».
a = 1
b = 2
c = 3
f = (((a * b) + (a * c)) ** 3) / 2
print(f)